codeigniter-mid_project/app/Controllers/PurchasesCrud.php

SELECT *
FROM `purchases`
ORDER BY `id` DESC
SELECT sum(price) as sumQuantities
FROM `purchases`
 LIMIT 1
---
    public function index(){
        $purchasesModel = new PurchasesModel();
        $data['purchases'] = $purchasesModel->orderBy('id', 'DESC')->findAll();
        $result = $purchasesModel->select('sum(price) as sumQuantities')->first();