codeigniter-mid_project/app/Controllers/UserCrud.php

SELECT *
FROM `customers`
ORDER BY `id` DESC
---
    public function index(){
        $customersModel = new CustomersModel();
        $data['customers'] = $customersModel->orderBy('id', 'DESC')->findAll();

INSERT INTO `customers` (`name`, `email`, `phone`, `age`, `address`) VALUES ('khaleda', 'rahim@gmail.com', '0653457', '90', 'china')
---
    public function store() {
        $customersModel = new CustomersModel();
        $data = [
            'name' => $this->request->getPost('name'),
            'email'  => $this->request->getPost('email'),
            'phone'  => $this->request->getPost('phone'),
            'age'  => $this->request->getPost('age'),
            'address'  => $this->request->getPost('address'),
        ];
        $customersModel->insert($data);

SELECT *
FROM `customers`
WHERE `id` = '38'
 LIMIT 1
---
    public function singleUser($id = null){
        $customersModel = new CustomersModel();
        $data['user_obj'] = $customersModel->where('id', $id)->first();

DELETE FROM `customers`
WHERE `id` = '38'
AND `id` IN ('38')
---
    public function delete($id = null){
        $customersModel = new CustomersModel();
        $data['user'] = $customersModel->where('id', $id)->delete($id);